{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_1", "trainable": true, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 75, 75, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_2", "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_3", "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "units": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "name": "dense_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_5", "trainable": true}}]}