{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32, "padding": "valid", "batch_input_shape": [null, 75, 75, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "units": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "sigmoid", "trainable": true}}], "backend": "tensorflow"}