{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 75, 75, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "filters": 32, "strides": [1, 1], "activation": "linear"}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "filters": 32, "strides": [1, 1], "activation": "linear"}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "filters": 64, "strides": [1, 1], "activation": "linear"}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_5", "activation": "sigmoid"}}], "keras_version": "2.1.5-tf", "backend": "tensorflow"}